---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PointClouds.IPointCloudAccess
source: html/1f72f24d-88e5-49d4-e025-299a545df76c.htm
---
# IPointCloudAccess Members

Implement this method to return an iterator for iterating over blocks of this point cloud.